app/controllers/category_scores_controller.rb

SELECT "category_scores".* FROM "category_scores"
---
    def index
        categoryScores = CategoryScore.all