app/controllers/habits_controller.rb

SELECT "habits".* FROM "habits"
---
    def index
        habits = Habit.all