app/controllers/habit_records_controller.rb

    def index
        user = User.find(params['user_id'])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        user = User.find(params['user_id'])
        #TODO: clean up to private method
        date = params['date']
        habit_records = []
        params[:habits].each do |habit_param|
            habit = user.habits.find{ |user_habit| habit_param[:name] == user_habit.name}
            habit_record = HabitRecord.create(habit: habit, yes_date: date)
            habit_records << habit_record
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "habits".* FROM "habits" WHERE "habits"."user_id" = $1  [["user_id", 1]]
INSERT INTO "habit_records" ("habit_id", "yes_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["habit_id", 3], ["yes_date", "2020-03-15"], ["created_at", "2020-03-17 23:05:38.730570"], ["updated_at", "2020-03-17 23:05:38.730570"]]
INSERT INTO "habit_records" ("habit_id", "yes_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["habit_id", 1], ["yes_date", "2020-04-20"], ["created_at", "2020-03-17 23:03:19.464922"], ["updated_at", "2020-03-17 23:03:19.464922"]]

    def weekly_records
        user = User.find(params['user_id'])
        start_date = Date.parse(params['start_date'])
        #TODO test if maybe it's +6 instead of +7 given the => and =< below
        end_date = start_date + 7
        habits = user ? user.habits : []
        habits_w_records = []
        habits.map do |habit|
            habit_w_records  = {name: habit.name,
                                habit_dates: []}
            habit.habit_records.each do |habit_record|
                habit_w_records[:habit_dates] << habit_record.yes_date if (habit_record.yes_date >= start_date && habit_record.yes_date <= end_date)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "habits".* FROM "habits" WHERE "habits"."user_id" = $1  [["user_id", 1]]
SELECT "habit_records".* FROM "habit_records" WHERE "habit_records"."habit_id" = $1  [["habit_id", 1]]
INSERT INTO "habit_records" ("habit_id", "yes_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["habit_id", 3], ["yes_date", "2020-03-19"], ["created_at", "2020-03-25 17:33:30.117744"], ["updated_at", "2020-03-25 17:33:30.117744"]]