app/controllers/life_wheels_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def index
        user = User.find(params['user_id'])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "life_wheels".* FROM "life_wheels" WHERE "life_wheels"."user_id" = $1  [["user_id", 1]]
SELECT "category_scores".* FROM "category_scores" WHERE "category_scores"."life_wheel_id" = $1  [["life_wheel_id", 1]]
INSERT INTO "life_wheels" ("user_id", "name", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["name", "April"], ["date", "2020-03-13"], ["created_at", "2020-03-13 19:02:21.318726"], ["updated_at", "2020-03-13 19:02:21.318726"]]
---
    def index_full
        user = User.find(params['user_id'])
        life_wheels = user ? user.life_wheels : []

        full_life_wheels = []
        life_wheels.each do |life_wheel|
            full_life_wheel = {name: life_wheel.name, date: life_wheel.date, id: life_wheel.id}
            full_cat_scores = []
            life_wheel.category_scores.each do |category_score|
                full_cat_score = {name: category_score.category.name,
                                  score: category_score.score}
                full_cat_scores << full_cat_score
            end
            full_life_wheel[:category_scores] = full_cat_scores

            full_life_wheels << full_life_wheel

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "life_wheels" ("user_id", "name", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["name", "March"], ["date", "2020-03-25"], ["created_at", "2020-03-25 17:37:31.800253"], ["updated_at", "2020-03-25 17:37:31.800253"]]
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = $1  [["user_id", 1]]
INSERT INTO "category_scores" ("category_id", "life_wheel_id", "score", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["category_id", 1], ["life_wheel_id", 3], ["score", 3], ["created_at", "2020-03-25 17:37:31.839285"], ["updated_at", "2020-03-25 17:37:31.839285"]]
---
    def create
        user = User.find(params['user_id'])
        time = Time.now
        month = time.strftime("%B")
        #TODO: change name after the fiels is added
        #TODO: clean up to private method
        date = time.strftime("%Y-%m-%d")
        life_wheel = LifeWheel.create(name: month, date: date, user: user)
        params[:category_scores].each do |category_score|
            category = user.categories.find{ |category| category.name == category_score[:name]}
            CategoryScore.create(category: category, life_wheel: life_wheel, score: category_score[:score])