app/controllers/life_wheels_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = $1  [["user_id", 1]]
INSERT INTO "category_scores" ("category_id", "life_wheel_id", "score", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["category_id", 1], ["life_wheel_id", 12], ["score", 5], ["created_at", "2020-03-13 19:09:10.791584"], ["updated_at", "2020-03-13 19:09:10.791584"]]
---
    def create
        user = User.find(params['user_id'])
        time = Time.now
        month = time.strftime("%B")
        #TBD: change name after the fiels is added
        date = time.strftime("%Y-%m-%d")
        life_wheel = LifeWheel.create(name: month, date: date, user: user)
        params[:category_scores].each do |category_score|
            category = user.categories.find{ |category| category.name == category_score[:name]}
            CategoryScore.create(category: category, life_wheel: life_wheel, score: category_score[:score])